# Реализуйте функцию filter_rrr, которая должна
# фильтровать картавые слова из текста input_str
# с помощью list comps. Функция на вход должна
# принимать строку, которая может содержать картавые
# слова, на выходе. Функция должна вернуть строку,
# которая не содержит картавых слов.
#
# Картавые слова - это
# слова, которые содержат хотя бы одну букву Р,
# если внутри слова встречается буква Р, нужно удалить
# слово целиком из результирующего текста, а не только одну букву.


input_str = "привет чао мой друг брат товарищ знакомый"


def filter_rrr(input_str):
    pass
    # TODO напишите свою функцию здесь


if __name__ == "__main__":
    print(filter_rrr(input_str))
